app/views/users/edit.html.erb

          <%= f.label :sex, value: t("users.profile.Sex") %>
          <%= f.select :sex, options_for_select(["Nam", "Nữ", "Khác"], (@user.user_profile.sex unless @user.user_profile.sex.nil?) )%>
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1