app/views/users/show.html.erb

SELECT `summaries`.* FROM `summaries` WHERE `summaries`.`user_id` = 1 AND (status = 1) ORDER BY `summaries`.`created_at` DESC
---
                    <section class="notepaper">
                      <% @user.summaries.suma.each do |s| %>