app/controllers/categories_controller.rb

  def cate
    @categories = Category.paginate(page: params[:page])
---
SELECT COUNT(*) FROM `categories`
SELECT `categories`.* FROM `categories` LIMIT 6 OFFSET 0

  def cate_detail
    @categories = Category.find_by(id: params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1