app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE (username = 'firesoul0608@gmail.com' or email = 'firesoul0608@gmail.com') ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
    @user = User.where("username = ? or email = ?", params[:session][:username], params[:session][:username]).first