app/controllers/summaries_controller.rb

  def create
    @summary = @current_user.summaries.new(summary_params)
    @summary.status = true
    if @summary.save
---
INSERT INTO `summaries` (`content`, `status`, `user_id`, `created_at`, `updated_at`) VALUES ('sdfsdfdsf', TRUE, 1, '2021-08-06 07:24:18.154079', '2021-08-06 07:24:18.154079')