app/controllers/users_controller.rb

  def found_user
    @user = User.find_by(id: session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def update
    @user.user_profile.image.attach(params[:user][:image])
    if @user.update(user_params) && @user.user_profile.update(user_profile_params)
---
INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('metghe', 'firesoul0608@gmail.com', '2021-08-01 09:30:06.918489', '2021-08-01 09:30:06.918489', '$2a$12$yDYp1lM5lxkYr7WsHwlZpukCazpuUp5qUyEsxHxkrw19cUuy4IGZe')
UPDATE `user_profiles` SET `user_profiles`.`sex` = '', `user_profiles`.`address` = '', `user_profiles`.`phone` = '', `user_profiles`.`updated_at` = '2021-08-06 08:50:32.880300' WHERE `user_profiles`.`id` = 1

  def create
    @user = User.new(user_params)
    if @user.save &&  @user.create_user_profile(fullname: @user.username)
---
INSERT INTO `user_profiles` (`fullname`, `user_id`, `created_at`, `updated_at`) VALUES ('metghe', 1, '2021-08-06 07:24:08.693813', '2021-08-06 07:24:08.693813')
INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('metghe', 'firesoul0608@gmail.com', '2021-08-06 07:24:08.635315', '2021-08-06 07:24:08.635315', '$2a$12$X/RUvZXaHkffVmGf1Fh9EuJ7zYXL7eW08eGh.OjSiOqYrQa0ss1L.')