app/controllers/users_controller.rb

  def show
    @categories = @user.categories
    @user_f = @user.following.ids
---
SELECT `categories`.* FROM `categories` INNER JOIN `wordlists` ON `categories`.`id` = `wordlists`.`category_id` WHERE `wordlists`.`user_id` = 1