app/controllers/wordlists_controller.rb

  def create
    if !Wordlist.where("category_id = ? and user_id = ?", params[:id_cate], current_user.id).first
      @word = Wordlist.new(category_id: params[:id_cate], user_id: current_user.id)
      if @word.save
---
SELECT `wordlists`.* FROM `wordlists` WHERE (category_id = '3' and user_id = 1) ORDER BY `wordlists`.`id` ASC LIMIT 1
INSERT INTO `wordlists` (`category_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-08-06 09:57:24.961012', '2021-08-06 09:57:24.961012')